log.txt
2020-01-18 18:08:30,169 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2020-01-18 18:08:30,203 INFO o.a.j.JMeter: Loading user properties from: user.properties
2020-01-18 18:08:30,205 INFO o.a.j.JMeter: Loading system properties from: system.properties
2020-01-18 18:08:30,218 INFO o.a.j.JMeter: Copyright (c) 1998-2017 The Apache Software Foundation
2020-01-18 18:08:30,218 INFO o.a.j.JMeter: Version 3.2 r1790748
2020-01-18 18:08:30,218 INFO o.a.j.JMeter: java.version=1.8.0_201
2020-01-18 18:08:30,219 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-01-18 18:08:30,219 INFO o.a.j.JMeter: os.name=Windows 10
2020-01-18 18:08:30,219 INFO o.a.j.JMeter: os.arch=amd64
2020-01-18 18:08:30,219 INFO o.a.j.JMeter: os.version=10.0
2020-01-18 18:08:30,219 INFO o.a.j.JMeter: file.encoding=GBK
2020-01-18 18:08:30,220 INFO o.a.j.JMeter: Max memory     =536870912
2020-01-18 18:08:30,220 INFO o.a.j.JMeter: Available Processors =8
2020-01-18 18:08:30,239 INFO o.a.j.JMeter: Default Locale=中文 (中国)
2020-01-18 18:08:30,240 INFO o.a.j.JMeter: JMeter  Locale=中文 (中国)
2020-01-18 18:08:30,240 INFO o.a.j.JMeter: JMeterHome=C:\Jmeter\apache-jmeter-3.2
2020-01-18 18:08:30,240 INFO o.a.j.JMeter: user.dir  =C:\Jmeter\apache-jmeter-3.2\bin
2020-01-18 18:08:30,241 INFO o.a.j.JMeter: PWD       =C:\Jmeter\apache-jmeter-3.2\bin
2020-01-18 18:08:30,245 INFO o.a.j.JMeter: IP: 192.168.12.79 Name: LAPTOP-3BSH24T4 FullName: LAPTOP-3BSH24T4
2020-01-18 18:08:30,251 INFO o.a.j.s.FileServer: Default base='C:\Jmeter\apache-jmeter-3.2\bin'
2020-01-18 18:08:30,251 INFO o.a.j.s.FileServer: Set new base='C:\jmeter_test_plan'
2020-01-18 18:08:30,477 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-01-18 18:08:30,521 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-01-18 18:08:30,534 INFO o.a.j.s.SaveService: Using SaveService properties version 3.2
2020-01-18 18:08:30,547 INFO o.a.j.s.SaveService: Loading file: C:\jmeter_test_plan\edit.jmx
2020-01-18 18:08:30,642 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-01-18 18:08:30,677 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-18 18:08:30,677 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-18 18:08:30,677 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-18 18:08:30,678 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-18 18:08:30,678 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-01-18 18:08:30,678 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-01-18 18:08:30,768 INFO o.a.j.JMeter: Creating summariser <summary>
2020-01-18 18:08:30,777 INFO o.a.j.e.DistributedRunner: Configuring remote engine: 192.168.137.128
2020-01-18 18:08:31,877 INFO o.a.j.e.DistributedRunner: Starting remote engines
2020-01-18 18:08:31,880 INFO o.a.j.e.DistributedRunner: Starting the test @ Sat Jan 18 18:08:31 CST 2020 (1579342111879)
2020-01-18 18:08:31,881 INFO o.a.j.e.ClientJMeterEngine: running clientengine run method
2020-01-18 18:08:31,889 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-01-18 18:08:31,889 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-01-18 18:08:32,618 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-18 18:08:32,630 INFO o.a.j.s.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000
2020-01-18 18:08:32,631 INFO o.a.j.s.DataStrippingSampleSender: Using DataStrippingSampleSender for this run
2020-01-18 18:08:33,673 INFO o.a.j.s.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000
2020-01-18 18:08:33,674 INFO o.a.j.s.DataStrippingSampleSender: Using DataStrippingSampleSender for this run
2020-01-18 18:08:33,678 INFO o.a.j.s.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000
2020-01-18 18:08:33,678 INFO o.a.j.s.DataStrippingSampleSender: Using DataStrippingSampleSender for this run
2020-01-18 18:08:33,679 INFO o.a.j.s.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000
2020-01-18 18:08:33,679 INFO o.a.j.s.DataStrippingSampleSender: Using DataStrippingSampleSender for this run
2020-01-18 18:08:34,068 INFO o.a.j.e.ClientJMeterEngine: sent test to 192.168.137.128 basedir='.'
2020-01-18 18:08:34,069 INFO o.a.j.e.ClientJMeterEngine: Sending properties {}
2020-01-18 18:08:34,096 INFO o.a.j.e.ClientJMeterEngine: sent run command to 192.168.137.128
2020-01-18 18:08:34,096 INFO o.a.j.e.DistributedRunner: Remote engines have been started
2020-01-18 18:08:34,339 INFO o.a.j.JMeter: Started remote host:  192.168.137.128 (1579342114338)
2020-01-18 18:08:35,818 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-01-18 18:08:35,819 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-01-18 18:08:35,819 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-01-18 18:08:35,819 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-01-18 18:08:41,604 INFO o.a.j.r.Summariser: summary =     36 in 00:00:07 =    5.0/s Avg:   296 Min:     0 Max:  1735 Err:     0 (0.00%)
2020-01-18 18:08:41,608 INFO o.a.j.JMeter: Finished remote host: 192.168.137.128 (1579342121608)
2020-01-18 18:08:46,618 INFO o.a.j.JMeter: Interrupting RMI Reaper