report/2020-12-21-10-00-02秒/statistics.json
{
  "事务控制器" : {
    "transaction" : "事务控制器",
    "sampleCount" : 0,
    "errorCount" : 0,
    "errorPct" : "NaN",
    "meanResTime" : "NaN",
    "medianResTime" : "NaN",
    "minResTime" : 9.223372036854776E18,
    "maxResTime" : -9.223372036854776E18,
    "pct1ResTime" : "NaN",
    "pct2ResTime" : "NaN",
    "pct3ResTime" : "NaN",
    "throughput" : 0.0,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "接收人登录" : {
    "transaction" : "接收人登录",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.0,
    "medianResTime" : 40.0,
    "minResTime" : 40.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 40.0,
    "throughput" : 25.0,
    "receivedKBytesPerSec" : 16.552734375,
    "sentKBytesPerSec" : 12.2314453125
  },
  "移交人登录" : {
    "transaction" : "移交人登录",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.0,
    "medianResTime" : 58.0,
    "minResTime" : 58.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 58.0,
    "pct2ResTime" : 58.0,
    "pct3ResTime" : 58.0,
    "throughput" : 17.241379310344826,
    "receivedKBytesPerSec" : 11.415678879310343,
    "sentKBytesPerSec" : 8.43547952586207
  },
  "调试取样器" : {
    "transaction" : "调试取样器",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 492.67578125,
    "sentKBytesPerSec" : 0.0
  },
  "发起人登录" : {
    "transaction" : "发起人登录",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 240.0,
    "medianResTime" : 240.0,
    "minResTime" : 240.0,
    "maxResTime" : 240.0,
    "pct1ResTime" : 240.0,
    "pct2ResTime" : 240.0,
    "pct3ResTime" : 240.0,
    "throughput" : 4.166666666666667,
    "receivedKBytesPerSec" : 2.783203125,
    "sentKBytesPerSec" : 1.3956705729166667
  },
  "总监审核通过表单" : {
    "transaction" : "总监审核通过表单",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 307.0,
    "medianResTime" : 307.0,
    "minResTime" : 235.0,
    "maxResTime" : 379.0,
    "pct1ResTime" : 379.0,
    "pct2ResTime" : 379.0,
    "pct3ResTime" : 379.0,
    "throughput" : 1.3054830287206267,
    "receivedKBytesPerSec" : 0.6572036145561357,
    "sentKBytesPerSec" : 1.1964802953655351
  },
  "验证表单生成" : {
    "transaction" : "验证表单生成",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 260.0,
    "medianResTime" : 260.0,
    "minResTime" : 260.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 260.0,
    "pct2ResTime" : 260.0,
    "pct3ResTime" : 260.0,
    "throughput" : 3.8461538461538463,
    "receivedKBytesPerSec" : 22.708834134615383,
    "sentKBytesPerSec" : 2.1709735576923075
  },
  "甲方登录" : {
    "transaction" : "甲方登录",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 35.0,
    "medianResTime" : 35.0,
    "minResTime" : 35.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 35.0,
    "throughput" : 28.57142857142857,
    "receivedKBytesPerSec" : 18.91741071428571,
    "sentKBytesPerSec" : 13.978794642857142
  },
  "甲方项目经理审核通过表单" : {
    "transaction" : "甲方项目经理审核通过表单",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 289.0,
    "medianResTime" : 289.0,
    "minResTime" : 289.0,
    "maxResTime" : 289.0,
    "pct1ResTime" : 289.0,
    "pct2ResTime" : 289.0,
    "pct3ResTime" : 289.0,
    "throughput" : 3.4602076124567476,
    "receivedKBytesPerSec" : 1.594939446366782,
    "sentKBytesPerSec" : 3.6866079152249136
  },
  "填写工作面移交表单" : {
    "transaction" : "填写工作面移交表单",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1194.0,
    "medianResTime" : 1194.0,
    "minResTime" : 1194.0,
    "maxResTime" : 1194.0,
    "pct1ResTime" : 1194.0,
    "pct2ResTime" : 1194.0,
    "pct3ResTime" : 1194.0,
    "throughput" : 0.8375209380234506,
    "receivedKBytesPerSec" : 0.38604480737018426,
    "sentKBytesPerSec" : 0.8735081658291458
  },
  "确认接收表单" : {
    "transaction" : "确认接收表单",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 305.0,
    "medianResTime" : 305.0,
    "minResTime" : 305.0,
    "maxResTime" : 305.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 305.0,
    "pct3ResTime" : 305.0,
    "throughput" : 3.278688524590164,
    "receivedKBytesPerSec" : 1.5112704918032787,
    "sentKBytesPerSec" : 2.5966956967213117
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 21,
    "errorCount" : 2,
    "errorPct" : 9.523809,
    "meanResTime" : 315.8095238095238,
    "medianResTime" : 240.0,
    "minResTime" : 2.0,
    "maxResTime" : 1833.0,
    "pct1ResTime" : 1031.0000000000005,
    "pct2ResTime" : 1769.099999999999,
    "pct3ResTime" : 1833.0,
    "throughput" : 3.003432494279176,
    "receivedKBytesPerSec" : 3.4478578196510297,
    "sentKBytesPerSec" : 3.009019236270023
  },
  "获取表单定义" : {
    "transaction" : "获取表单定义",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 262.0,
    "medianResTime" : 262.0,
    "minResTime" : 262.0,
    "maxResTime" : 262.0,
    "pct1ResTime" : 262.0,
    "pct2ResTime" : 262.0,
    "pct3ResTime" : 262.0,
    "throughput" : 3.8167938931297707,
    "receivedKBytesPerSec" : 12.36730677480916,
    "sentKBytesPerSec" : 2.0873091603053435
  },
  "确认移交表单" : {
    "transaction" : "确认移交表单",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1833.0,
    "medianResTime" : 1833.0,
    "minResTime" : 1833.0,
    "maxResTime" : 1833.0,
    "pct1ResTime" : 1833.0,
    "pct2ResTime" : 1833.0,
    "pct3ResTime" : 1833.0,
    "throughput" : 0.5455537370430987,
    "receivedKBytesPerSec" : 0.2514661756683033,
    "sentKBytesPerSec" : 0.43207429759956356
  },
  "总监登录" : {
    "transaction" : "总监登录",
    "sampleCount" : 2,
    "errorCount" : 2,
    "errorPct" : 100.0,
    "meanResTime" : 38.5,
    "medianResTime" : 38.5,
    "minResTime" : 31.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 46.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 46.0,
    "throughput" : 1.529051987767584,
    "receivedKBytesPerSec" : 0.8138020833333333,
    "sentKBytesPerSec" : 0.748100630733945
  },
  "上传附件" : {
    "transaction" : "上传附件",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.0,
    "medianResTime" : 126.0,
    "minResTime" : 126.0,
    "maxResTime" : 126.0,
    "pct1ResTime" : 126.0,
    "pct2ResTime" : 126.0,
    "pct3ResTime" : 126.0,
    "throughput" : 7.936507936507936,
    "receivedKBytesPerSec" : 4.177517361111111,
    "sentKBytesPerSec" : 71.01779513888889
  },
  "获取表单审核内容" : {
    "transaction" : "获取表单审核内容",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 235.0,
    "medianResTime" : 230.0,
    "minResTime" : 209.0,
    "maxResTime" : 266.0,
    "pct1ResTime" : 266.0,
    "pct2ResTime" : 266.0,
    "pct3ResTime" : 266.0,
    "throughput" : 1.9646365422396854,
    "receivedKBytesPerSec" : 1.4658030451866406,
    "sentKBytesPerSec" : 1.0628990667976426
  },
  "获取发起表单定义" : {
    "transaction" : "获取发起表单定义",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 306.0,
    "medianResTime" : 306.0,
    "minResTime" : 306.0,
    "maxResTime" : 306.0,
    "pct1ResTime" : 306.0,
    "pct2ResTime" : 306.0,
    "pct3ResTime" : 306.0,
    "throughput" : 3.2679738562091503,
    "receivedKBytesPerSec" : 12.599571078431373,
    "sentKBytesPerSec" : 1.6627093545751634
  },
  "获取表单移交内容" : {
    "transaction" : "获取表单移交内容",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 286.0,
    "medianResTime" : 286.0,
    "minResTime" : 286.0,
    "maxResTime" : 286.0,
    "pct1ResTime" : 286.0,
    "pct2ResTime" : 286.0,
    "pct3ResTime" : 286.0,
    "throughput" : 3.4965034965034967,
    "receivedKBytesPerSec" : 2.7555452360139863,
    "sentKBytesPerSec" : 1.8916630244755246
  }
}