test_result/2020-12-24-10-00-01秒/jmeter.log
2020-12-24 10:00:06,618 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-12-24 10:00:06,668 INFO o.a.j.JMeter: Loading user properties from: C:\apache-jmeter-5.3\bin\user.properties
2020-12-24 10:00:06,671 INFO o.a.j.JMeter: Loading system properties from: C:\apache-jmeter-5.3\bin\system.properties
2020-12-24 10:00:06,676 INFO o.a.j.JMeter: Copyright (c) 1998-2020 The Apache Software Foundation
2020-12-24 10:00:06,676 INFO o.a.j.JMeter: Version 5.3
2020-12-24 10:00:06,677 INFO o.a.j.JMeter: java.version=1.8.0_201
2020-12-24 10:00:06,677 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-12-24 10:00:06,677 INFO o.a.j.JMeter: os.name=Windows 10
2020-12-24 10:00:06,678 INFO o.a.j.JMeter: os.arch=amd64
2020-12-24 10:00:06,678 INFO o.a.j.JMeter: os.version=10.0
2020-12-24 10:00:06,679 INFO o.a.j.JMeter: file.encoding=GBK
2020-12-24 10:00:06,679 INFO o.a.j.JMeter: java.awt.headless=true
2020-12-24 10:00:06,679 INFO o.a.j.JMeter: Max memory     =1073741824
2020-12-24 10:00:06,679 INFO o.a.j.JMeter: Available Processors =8
2020-12-24 10:00:06,697 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-12-24 10:00:06,697 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-12-24 10:00:06,698 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.3
2020-12-24 10:00:06,698 INFO o.a.j.JMeter: user.dir  =C:\Users\hallo\AppData\Local\Programs\Python
2020-12-24 10:00:06,700 INFO o.a.j.JMeter: PWD       =C:\Users\hallo\AppData\Local\Programs\Python
2020-12-24 10:00:06,706 INFO o.a.j.JMeter: IP: 192.168.13.67 Name: LAPTOP-3BSH24T4 FullName: LAPTOP-3BSH24T4
2020-12-24 10:00:06,717 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\jmeter_test_plan\report\2020-12-24-10-00-01秒'
2020-12-24 10:00:06,725 INFO o.a.j.s.FileServer: Default base='C:\Users\hallo\AppData\Local\Programs\Python'
2020-12-24 10:00:06,746 INFO o.a.j.s.FileServer: Set new base='C:\jmeter_test_plan'
2020-12-24 10:00:07,224 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-12-24 10:00:07,318 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-12-24 10:00:07,340 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-12-24 10:00:07,367 INFO o.a.j.s.SaveService: Loading file: C:\jmeter_test_plan\工作面移交-新.jmx
2020-12-24 10:00:07,584 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-12-24 10:00:07,618 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-24 10:00:07,618 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-24 10:00:07,619 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-24 10:00:07,619 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-24 10:00:07,619 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-12-24 10:00:07,619 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-12-24 10:00:07,933 INFO o.a.j.JMeter: Creating summariser <summary>
2020-12-24 10:00:07,974 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-12-24 10:00:07,974 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\jmeter_test_plan\test_result\2020-12-24-10-00-01秒\result.jtl
2020-12-24 10:00:07,975 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\apache-jmeter-5.3\bin\reportgenerator.properties
2020-12-24 10:00:08,038 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-12-24 10:00:08,056 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-12-24 10:00:08,066 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-12-24 10:00:08,067 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-12-24 10:00:08,067 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-12-24 10:00:08,067 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-12-24 10:00:08,067 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-12-24 10:00:08,068 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-12-24 10:00:08,068 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-12-24 10:00:08,069 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-12-24 10:00:08,082 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,083 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,083 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,084 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,084 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,084 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,085 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,085 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,086 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,086 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-24 10:00:08,099 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-12-24 10:00:08,099 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-12-24 10:00:08,100 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-12-24 10:00:08,101 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-12-24 10:00:08,101 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-12-24 10:00:08,101 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-12-24 10:00:08,121 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-12-24 10:00:08,122 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-12-24 10:00:08,122 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-12-24 10:00:08,140 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-12-24 10:00:08,140 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-12-24 10:00:09,534 INFO o.a.j.JMeter: Running test (1608775209534)
2020-12-24 10:00:09,646 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 工作面移交
2020-12-24 10:00:09,647 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 工作面移交.
2020-12-24 10:00:09,647 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-12-24 10:00:09,648 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-12-24 10:00:09,665 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-12-24 10:00:09,665 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-12-24 10:00:09,679 INFO o.a.j.t.JMeterThread: Thread started: 工作面移交 1-1
2020-12-24 10:00:09,746 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-3BSH24T4
2020-12-24 10:00:09,786 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-12-24 10:00:09,790 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-12-24 10:00:09,790 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2020-12-24 10:00:09,790 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-12-24 10:00:09,790 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-12-24 10:00:11,265 INFO o.a.j.s.FileServer: Stored: C:\workspace\my_png\IMG_2.png
2020-12-24 10:00:19,138 INFO o.a.j.t.JMeterThread: Thread is done: 工作面移交 1-1
2020-12-24 10:00:19,138 INFO o.a.j.t.JMeterThread: Thread finished: 工作面移交 1-1
2020-12-24 10:00:19,141 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-12-24 10:00:19,147 INFO o.a.j.r.Summariser: summary =     38 in 00:00:10 =    4.0/s Avg:   230 Min:     0 Max:   636 Err:     0 (0.00%)
2020-12-24 10:00:19,150 INFO o.a.j.JMeter: Generating Dashboard
2020-12-24 10:00:19,150 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-12-24 10:00:19,185 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-12-24 10:00:21,048 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-12-24 10:00:21,048 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-12-24 10:00:21,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-12-24 10:00:21,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-12-24 10:00:21,067 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-12-24 10:00:21,083 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-12-24 10:00:21,083 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-12-24 10:00:21,084 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-12-24 10:00:21,129 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-12-24 10:00:21,130 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-12-24 10:00:21,130 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-12-24 10:00:21,131 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-12-24 10:00:21,146 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-12-24 10:00:21,147 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 266 samples
2020-12-24 10:00:21,147 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-12-24 10:00:21,147 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-12-24 10:00:21,148 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-12-24 10:00:21,150 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-12-24 10:00:21,151 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-12-24 10:00:21,151 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-12-24 10:00:21,161 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-12-24 10:00:21,161 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-12-24 10:00:21,162 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-12-24 10:00:21,162 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-12-24 10:00:21,162 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 570 samples
2020-12-24 10:00:21,162 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 114 samples
2020-12-24 10:00:21,163 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 38 samples
2020-12-24 10:00:21,164 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 38 samples produced in 1s 879 ms on channel 0
2020-12-24 10:00:21,164 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-12-24 10:00:21,168 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary?in context
2020-12-24 10:00:21,168 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-12-24 10:00:21,169 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-12-24 10:00:21,170 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-12-24 10:00:21,172 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\jmeter_test_plan\report\2020-12-24-10-00-01秒\statistics.json
2020-12-24 10:00:21,739 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-12-24 10:00:21,752 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\jmeter_test_plan\report\2020-12-24-10-00-01秒
2020-12-24 10:00:22,548 ERROR f.configuration: DefaultObjectWrapper.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-12-24 10:00:22,553 ERROR f.configuration: Configuration.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-12-24 10:00:22,603 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\jmeter_test_plan\report\2020-12-24-10-00-01秒, creating folder structure
2020-12-24 10:00:22,612 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\apache-jmeter-5.3\bin\report-template' to 'C:\jmeter_test_plan\report\2020-12-24-10-00-01秒', got message: C:\jmeter_test_plan\report\2020-12-24-10-00-01秒, found non empty folder with following content [C:\jmeter_test_plan\report\2020-12-24-10-00-01秒\statistics.json], will be ignored
2020-12-24 10:00:24,082 INFO o.a.j.JMeter: Dashboard generated